OdStepFile.writeFile(OdSmartPtr&lt;OdStreamBuf&gt;,System.Boolean)
\details
Writes data from the specified stream buffer to a physical file.
\param pStream      [in] A smart pointer to the output stream buffer object to wtite data.
\param saveLogFile  [in] A flag that determines whether the log file should be also written (if equal to true) or not (if equal to false).
\returns eOk if the data was successfully written; otherwise, the method returns an appropriate error code.

OdStepFile.getShortFileName
Retrieves the current name (file name) of a physical file associated with the repository object without path to the file.
\returns A string that contains the file name withaut path to it.

OdStepFile.setFileName(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Assigns a name (file name) to the OdStepFile container.

OdStepFile.getFileName
Retrieves the current name (file name) of a physical file associated with the repository object.
\returns A string that contains the file name.